{
  "backend/main.mo": "Motoko canister defining schools, teachers, trainings, reviews, blog posts, and user profiles with role‑based access control and admin CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to required frontend files, components, and test IDs for carousel and gallery updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend pages, components, hooks, and styling configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark OKLCH color tokens and global background/foreground variables.",
  "frontend/index.html": "Basic HTML template bootstrapping the React app via main.tsx and setting page metadata.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing yogaschooldirectory.com.",
  "frontend/src/App.tsx": "Root React setup configuring TanStack Router routes, React Query, theming, header/footer layout, and page components.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin gate component handling Internet Identity login, logout, and gated access to admin content.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Tabbed admin dashboard providing UI sections for managing schools, teachers, trainings, and reviews.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Admin section listing reviews with school lookup and delete functionality using alert dialogs.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Admin interface for creating, editing, and deleting schools with form dialogs and validation.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Admin UI to list, create, and delete teachers, with school assignment and form dialogs.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Admin section for managing trainings, including creation with validation and deletion.",
  "frontend/src/components/common/CopyLinkButton.tsx": "Button that copies a URL to the clipboard and shows success or error feedback.",
  "frontend/src/components/common/SocialLinks.tsx": "Renders a row of social link icons, filtering out invalid links.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Static informational sections explaining how the directory works and its benefits.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with image carousel, basic info, and navigation to the school detail page, using curated or fallback images.",
  "frontend/src/components/directory/TeacherList.tsx": "Renders a list of teachers with avatars and specialization badges, or a placeholder when none exist.",
  "frontend/src/components/layout/Footer.tsx": "Provides the footer with about text, quick navigation links, social links, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Implements the site header with logo, navigation, social links, theme support, and a mobile dropdown menu.",
  "frontend/src/components/routing/RouterErrorFallback.tsx": "Shows an error message and a link to return home when a router error occurs.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Displays an About section for a school, using a generated default description when none is provided.",
  "frontend/src/components/school/faqContent.ts": "Defines an FAQ item interface and provides a default list of school-related FAQ entries.",
  "frontend/src/components/school/FAQSection.tsx": "Renders an FAQ accordion list for a school using provided questions and answers.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Shows a clickable image gallery with a modal viewer, using default images when none are supplied.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "A contact form component with validation and simulated submission for users to inquire about a school.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Displays a school’s location with an optional Google Maps embed and a link to open the location in Google Maps.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "A banner component with a slideshow of images, navigation controls, and school name/location overlay.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Fetches and displays school reviews, shows rating summaries, and provides a form for authenticated users to submit new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Shows a list of training courses with metadata and navigation to detailed curriculum pages, plus an explore-scroll feature.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Embeds a YouTube video for the school by extracting the video ID from various URL formats or shows a fallback message.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and lists similar schools or shows loading and empty states when applicable.",
  "frontend/src/config/socialLinks.ts": "Exports a list of social link configurations with labels, empty URLs, and associated icons.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides hooks to fetch all reviews across schools for admins and a placeholder mutation for deleting reviews.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Offers admin hooks to list, create, update, and delete schools using backend actor calls with error handling.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Implements hooks for admins to fetch teachers across schools and create or delete teacher records.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Supplies hooks to load all trainings for admins and to create or delete training entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Provides hooks for fetching all blog posts or a single post through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, stored identity handling, and identity provider setup.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches a school's trainings and teachers with react-query and returns loading state.",
  "frontend/src/hooks/useSchoolDetails.ts": "Loads a school plus its teachers and trainings, exposing data, loading, and error states.",
  "frontend/src/hooks/useSchoolReviews.ts": "Retrieves reviews for a school and provides a mutation to submit new reviews.",
  "frontend/src/hooks/useSchools.ts": "Fetches all schools and optionally filters them by training hours, including training lookups.",
  "frontend/src/hooks/useSchoolsByLocation.ts": "Fetches schools filtered by country, state, and city via backend location API.",
  "frontend/src/hooks/useSimilarSchools.ts": "Finds similar schools by comparing training hours and returns the top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Loads a school and a specific training for curriculum pages and returns data with loading/error states.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light/dark mode styling.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides structured logging for backend call failures with timestamps and metadata.",
  "frontend/src/lib/blogContent.ts": "Utility functions for generating excerpts, splitting content into paragraphs, and selecting display excerpts.",
  "frontend/src/lib/curatedSchoolMedia.ts": "Returns curated media assets for certain schools, including thumbnails and gallery images.",
  "frontend/src/lib/locationFormat.ts": "Formats structured location data, sanitizes segments, and detects structured locations.",
  "frontend/src/lib/locationRoutes.ts": "Builds URL paths and breadcrumbs for structured locations with encoding helpers.",
  "frontend/src/lib/schoolThumbnails.ts": "Deterministically maps school IDs to demo thumbnail images using a simple hash.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission details and feature cards describing community, certification, and global reach.",
  "frontend/src/pages/AdminPage.tsx": "Checks Internet Identity authentication and wraps the admin dashboard with an access gate.",
  "frontend/src/pages/BlogPage.tsx": "Fetches and displays a list of blog posts with loading, error, and empty states, including card previews and navigation.",
  "frontend/src/pages/BlogPostPage.tsx": "Loads and displays a single blog post with full content, handling loading, error, and not-found states.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information and a placeholder contact form with non-functional submission.",
  "frontend/src/pages/DirectoryPage.tsx": "Implements a school directory with hour-based filters, scroll navigation, and loading/error handling for fetched school data.",
  "frontend/src/pages/LocationListingPage.tsx": "Lists yoga schools for a decoded country/state/city, handling loading, errors, and empty results with UI components.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Displays detailed school information including banner, about section, courses, media, reviews, and inquiry form with loading and error states.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Provides informational UI about submitting or claiming a school listing, with disabled future-action buttons and guidelines.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Shows detailed curriculum info for a specific training program with navigation, loading/error handling, and course overview sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin usage for the frontend.",
  "project_state.json": "Defines project state, goals, architectural notes, and known issues for building a WordPress-based responsive Yoga Schools Directory with seeding, admin dashboard, routing constraints, and UI/layout bugs. Serves as a high-level specification and issue tracker for the current build."
}