{
  "backend/main.mo": "Main actor defines school, teacher, training, and review types with CRUD-style add and query methods backed by Map and List collections.",
  "backend/migration.mo": "Migration module clones old state and injects demo schools on upgrade if missing.",
  "feature_evidence.json": "Feature evidence metadata describing a frontend change to add retry behavior for the Directory error state.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including pages, components, hooks, styling, and configuration.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables for global theming.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders the app layout with header, footer, theming, and toasts.",
  "frontend/src/components/directory/SchoolCard.tsx": "Renders a school card with image, location, training badges, teacher count, and navigation to the detail page.",
  "frontend/src/components/directory/TeacherList.tsx": "Displays a list of teacher cards or an empty-state message when no teachers are available.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with navigation links, contact info, current year, and attribution link.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation (desktop and mobile), and a theme toggle.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Displays an About section for a school with default generated text when none is provided.",
  "frontend/src/components/school/faqContent.ts": "Exports a list of static FAQ items with questions and answers for school pages.",
  "frontend/src/components/school/FAQSection.tsx": "Renders a FAQ list using an accordion UI inside a card.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Photo gallery with default images and a modal viewer for selected images.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Shows a Google Maps embed and link for a school location or a fallback message if missing.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Displays school reviews, average rating, and a form for authenticated users to submit new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Lists a school's training courses with hours, duration estimates, descriptions, and navigation to curriculum pages.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Renders a card that extracts a YouTube video ID from various URL formats and embeds it, or shows a fallback message.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Displays similar schools using a custom hook with loading, empty, and populated states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user’s Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches a school’s trainings and teachers via the backend actor for summary card displays.",
  "frontend/src/hooks/useSchoolDetails.ts": "Retrieves full school details, teachers, and trainings with loading and error aggregation.",
  "frontend/src/hooks/useSchoolReviews.ts": "Loads reviews for a school and provides a mutation to submit new reviews with cache invalidation.",
  "frontend/src/hooks/useSchools.ts": "Fetches all schools and optionally filters them by matching training hours, including per-school training retrieval.",
  "frontend/src/hooks/useSimilarSchools.ts": "Computes similar schools by comparing training hours to the current school and returns top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Loads a school and a specific training for curriculum pages with combined loading and error states.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, applying global styles.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides a function to log structured diagnostic information for backend call failures.",
  "frontend/src/lib/schoolThumbnails.ts": "Implements a deterministic hash-based selector to map school IDs to one of several thumbnail image paths.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, features, and informational cards for the yoga school directory.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a non-functional placeholder contact form within styled cards.",
  "frontend/src/pages/DirectoryPage.tsx": "Shows the school directory with filter options, loading and error states, and a list of school cards.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Fetches and displays detailed school information including courses, teachers, reviews, and media sections.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Static informational page showing options to submit or claim a school, with disabled buttons and guidelines.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Displays detailed training curriculum data with loading, error states, metadata, and generated highlights.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, animations, and enabling plugins.",
  "project_state.json": "Project state metadata describing requirements, existing features, and persistent issues loading school data."
}