{
  "backend/main.mo": "Motoko canister storing schools, teachers, trainings, reviews, user profiles, and blog posts with access control and demo data seeding on upgrade.",
  "backend/migration.mo": "Migration module that forwards old actor state to new actor without transformation.",
  "feature_evidence.json": "Feature evidence report describing a frontend requirement to correctly render school listings and handle empty responses without showing an error banner.",
  "frontend-file-summaries.txt": "Prewritten collection of summaries for various frontend source files including pages, components, and hooks.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background and text.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/public/.well-known/ic-domains": "Lists the allowed domain for Internet Computer canister requests.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, React Query, theming, routes, and global layout.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin access gate component prompting Internet Identity sign-in and wrapping protected admin content.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Tabbed admin dashboard showing management sections for schools, teachers, trainings, and reviews.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Displays all reviews in a table with school lookup and supports deleting reviews with confirmation dialogs.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Manages school records including listing, creating, editing, and deleting schools with form dialogs.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Lists teachers and provides UI for creating and deleting teacher entries, including school assignment.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Shows trainings and allows creating and deleting training records with validation and school selection.",
  "frontend/src/components/common/CopyLinkButton.tsx": "Renders a button that copies a provided or current URL to the clipboard and shows success feedback.",
  "frontend/src/components/common/SocialLinks.tsx": "Displays a row of social media icons linking to external URLs, filtering out invalid entries.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Provides informational marketing sections explaining how the directory works and its benefits.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with image carousel, basic info, and navigation to the school detail page.",
  "frontend/src/components/directory/TeacherList.tsx": "Renders a list of teacher cards with avatars and specializations, or a placeholder when none exist.",
  "frontend/src/components/layout/Footer.tsx": "Provides the site footer with navigation links, contact info, social links, and branding.",
  "frontend/src/components/layout/Header.tsx": "Implements the main site header with navigation, theme toggle, social links, and mobile dropdown menu.",
  "frontend/src/components/routing/RouterErrorFallback.tsx": "Shows an error page with details and a button to return home when routing fails.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Displays an 'About School' description using provided text or a generated default.",
  "frontend/src/components/school/faqContent.ts": "Defines an FAQItem interface and exports a default list of school-related FAQ questions and answers.",
  "frontend/src/components/school/FAQSection.tsx": "Renders a FAQ accordion list inside a card.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Shows a grid image gallery with a modal viewer and fallback default images.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "Contact form for school inquiries with validation, simulated submission, and success alert.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Displays a Google Maps embed and link for a school location, handling missing location data.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "Carousel banner for a school profile with navigation, keyboard support, and fallback images.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Shows school reviews, average rating, and a form for authenticated users to submit new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Lists a school's training courses with hours, estimated days, descriptions, and navigation actions.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Embeds a YouTube video for a school if a valid URL or ID is provided, otherwise shows a fallback message.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and displays similar schools with loading and empty states using SchoolCard components.",
  "frontend/src/config/socialLinks.ts": "Defines a SocialLink interface and provides default social media link entries with placeholder URLs and icon components.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides hooks to fetch all reviews across schools for admins and a stubbed delete-review mutation that currently always errors.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Contains admin hooks for listing, creating, updating, and deleting schools with backend error handling and query invalidation.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Provides admin hooks to fetch all teachers across schools and to create or delete teachers with appropriate validations.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Provides admin hooks to fetch all trainings across schools and to create or delete trainings with backend-driven error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and triggers query invalidation when the actor changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Implements hooks to fetch all blog posts or a single blog post using the backend actor with error logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider, handling identity loading, login, logout, and related state.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches trainings and teachers for a school using React Query and returns loading state.",
  "frontend/src/hooks/useSchoolDetails.ts": "Loads school details, teachers, and trainings with React Query and aggregates loading and error states.",
  "frontend/src/hooks/useSchoolReviews.ts": "Retrieves reviews for a school and provides a mutation for adding new reviews with cache invalidation.",
  "frontend/src/hooks/useSchools.ts": "Fetches all schools, optionally filters by training hours, and logs backend failures.",
  "frontend/src/hooks/useSchoolsByLocation.ts": "Loads schools filtered by country, state, and city with error diagnostics.",
  "frontend/src/hooks/useSimilarSchools.ts": "Computes similar schools by comparing training hours and returns the top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Fetches a school and a training by ID and aggregates loading and error states.",
  "frontend/src/index.css": "Defines Tailwind base styles with custom color variables for light and dark themes.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides utilities for logging backend call failures and normalizing errors.",
  "frontend/src/lib/blogContent.ts": "Contains helpers for generating excerpts and splitting blog content into paragraphs.",
  "frontend/src/lib/curatedSchoolMedia.ts": "Returns curated thumbnails and gallery images for specific schools.",
  "frontend/src/lib/locationFormat.ts": "Formats structured location fields and provides sanitization utilities.",
  "frontend/src/lib/locationRoutes.ts": "Provides helpers for building location-based routes and breadcrumbs.",
  "frontend/src/lib/schoolThumbnails.ts": "Provides deterministic school thumbnail selection using a simple hash and exposes a default thumbnail.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission info, feature cards, and placeholder descriptive content.",
  "frontend/src/pages/AdminPage.tsx": "Wraps the admin dashboard in an access gate based on Internet Identity authentication.",
  "frontend/src/pages/BlogPage.tsx": "Displays a list of blog posts with loading, error, empty states, and navigation to individual posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with loading and error handling plus a back-to-blog navigation button.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact info cards and a placeholder non-functional contact form.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays yoga school directory with filter controls, hero section, info sections, and error/loading handling.",
  "frontend/src/pages/LocationListingPage.tsx": "Displays yoga schools for a given location, handling loading, errors, and empty states with decoded URL params.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Fetches and renders full school details including banner, sections, teachers, courses, media, and inquiry form.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Static informational page outlining options and requirements for submitting or claiming a school listing.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Shows detailed training curriculum for a school with loading/error states and navigation back to the school page.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, containers, animations, and plugins for the frontend.",
  "project_state.json": "Tracks the project’s schema version, current build state, features, architectural notes, and known issues for the Yoga Schools Directory. Describes requirements like seeding data, admin dashboard, routing notes, domain setup, and chronic frontend load failures."
}