{
  "backend/main.mo": "Primary backend actor implementing access control, user profiles, and CRUD operations for schools, teachers, trainings, reviews, and blog posts with authorization checks.",
  "backend/migration.mo": "Migration module converting old actor data to the new schema by adding structured location fields to schools.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test cases with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind base styles defining light and dark mode color tokens and applying global background and text styles.",
  "frontend/index.html": "HTML entry point containing the root div and script tag loading the React application.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, global layout, theming, and React Query provider.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin access gate component handling Internet Identity login, logout, and gating admin dashboard content.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Provides the admin dashboard with tab navigation for schools, teachers, trainings, and reviews sections.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Displays and manages reviews, including listing, school lookup, and deletion with confirmation dialogs.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Handles creation, editing, listing, and deletion of schools with form dialogs and validation.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Manages teacher records, including listing, creation with school assignment, and deletion.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Manages training programs with creation, validation of hours, listing, and deletion features.",
  "frontend/src/components/common/CopyLinkButton.tsx": "Renders a button that copies a given URL to the clipboard with success or error feedback.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Provides static informational sections explaining how the directory works and why to use it.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with image, location, training badges, teacher count, and a button linking to the school details page.",
  "frontend/src/components/directory/TeacherList.tsx": "Renders a list of teachers with avatars and specializations, or a placeholder if none exist.",
  "frontend/src/components/layout/Footer.tsx": "Provides the site footer with about text, navigation links, contact info, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Renders the main header with logo, navigation (desktop and mobile), and a theme toggle.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Shows an about section for a school, generating default text when no description is provided.",
  "frontend/src/components/school/faqContent.ts": "Exports default FAQ items containing common questions and answers about yoga teacher training.",
  "frontend/src/components/school/FAQSection.tsx": "Displays an FAQ accordion with expandable questions and answers.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Presents an image gallery with a modal viewer for enlarged images.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "Implements an inquiry form with validation, submission simulation, and success feedback.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Displays a Google Maps embed and link for a school’s location, or a fallback message if no location is provided.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "Renders a large banner with the school’s name, location, background image, and optional inquire button.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Fetches and displays school reviews, shows average ratings, and provides a form for authenticated users to submit new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Lists a school’s training programs with hours, estimated duration, descriptions, and actions to view curricula or inquire.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Extracts a YouTube video ID and embeds the school’s video or shows a fallback message if unavailable.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and displays similar schools, showing loading skeletons or a fallback message when appropriate.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides admin hooks to fetch all school reviews and a placeholder mutation for deleting reviews.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Provides admin hooks to list, create, update, and delete schools with backend error handling and cache invalidation.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Provides queries and mutations for admins to list, create, and delete teachers across all schools.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Implements admin-level fetching, creation, and deletion of trainings aggregated from all schools.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Fetches all blog posts or a single post using the backend actor with error logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state and login/logout functions.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches teachers and trainings for a given school to populate lightweight school cards.",
  "frontend/src/hooks/useSchoolDetails.ts": "Loads full school details including teachers and trainings with combined loading and error states.",
  "frontend/src/hooks/useSchoolReviews.ts": "Retrieves reviews for a school and provides a mutation to submit new reviews.",
  "frontend/src/hooks/useSchools.ts": "Returns schools filtered by selected training hours, fetching trainings when needed.",
  "frontend/src/hooks/useSchoolsByLocation.ts": "Queries schools by country, state, and city with backend error logging.",
  "frontend/src/hooks/useSimilarSchools.ts": "Computes similar schools by comparing training hours, returning top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Fetches school and training data using react-query and combines loading and error states.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides a helper to log structured error details for failed backend calls.",
  "frontend/src/lib/blogContent.ts": "Utilities for generating excerpts, splitting content into paragraphs, and selecting display excerpts.",
  "frontend/src/lib/locationFormat.ts": "Formats structured location data into readable strings and checks for structured fields.",
  "frontend/src/lib/locationRoutes.ts": "Builds location-based URL paths, encodes/decodes segments, and generates breadcrumbs.",
  "frontend/src/lib/schoolThumbnails.ts": "Selects deterministic thumbnail images for schools based on a simple hash of the ID.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page with mission, features, and informational cards.",
  "frontend/src/pages/AdminPage.tsx": "Displays the admin dashboard behind an authentication gate using Internet Identity.",
  "frontend/src/pages/BlogPage.tsx": "Lists blog posts with loading, error, and empty states, showing excerpts and navigation links.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with loading/error states and renders content paragraphs.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with placeholder contact info cards and a non-functional message form.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays a yoga school directory with banner, filters, and scrollable search results using selected training-hour filters.",
  "frontend/src/pages/LocationListingPage.tsx": "Shows yoga schools filtered by decoded country/state/city route params with loading, error, and empty states.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Loads and displays detailed school info including banner, about section, courses, teachers, media, map, reviews, and inquiry form.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Provides informational cards about submitting or claiming a school listing, with future-implementation placeholders.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "React page that loads and displays a yoga training curriculum with loading/error states, school info, and curriculum details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support, including hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, animations, and container settings with plugins included.",
  "project_state.json": "Project metadata describing the yoga directory app’s features, issues, and architectural notes."
}