{
  "backend/main.mo": "Motoko canister storing schools, teachers, trainings, reviews, and blog posts with access control and demo data seeding on upgrade.",
  "feature_evidence.json": "Feature evidence report listing two UI banner update requirements tied to SchoolProfileBanner.tsx with metadata and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend pages, components, hooks, and styles used in the application.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theme variables, and global background/foreground rules including dark mode overrides.",
  "frontend/index.html": "HTML entry point setting up root div and loading main.tsx for the React app.",
  "frontend/public/.well-known/ic-domains": "Defines the verified domain yogaschooldirectory.com.",
  "frontend/src/App.tsx": "React entry component configuring TanStack Router routes, QueryClient, theming, layout, and top-level providers.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin access wrapper handling Internet Identity login/logout and gating admin content with status UI and fallback card.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard tabs for managing schools, teachers, trainings, and reviews using section components.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Displays all reviews with school lookup, loading state, and delete confirmation using admin review hooks.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Manages school records with create, edit, and delete dialogs using admin school mutation hooks.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Lists teachers and provides creation and deletion with school selection and admin teacher hooks.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Handles listing, creation, and deletion of training programs, validating hours and associating them with schools.",
  "frontend/src/components/common/CopyLinkButton.tsx": "Button that copies a provided or current URL to clipboard with success/error toasts and state feedback.",
  "frontend/src/components/common/SocialLinks.tsx": "Renders a row of external social link icons after filtering out invalid links.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Static informational sections explaining how the directory works and its benefits using styled cards and icons.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with thumbnail, location, trainings, teacher count, and a button to view details.",
  "frontend/src/components/directory/TeacherList.tsx": "Renders a list of teachers with avatars, names, and specializations, or a placeholder if none exist.",
  "frontend/src/components/layout/Footer.tsx": "Footer with about text, navigation links, social links, and branding information.",
  "frontend/src/components/layout/Header.tsx": "Header containing logo, navigation links, social links, theme toggling, and a mobile dropdown menu.",
  "frontend/src/components/routing/RouterErrorFallback.tsx": "Error fallback UI showing an error message and a button to return home.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Displays an about section for a school with provided or autogenerated description text.",
  "frontend/src/components/school/faqContent.ts": "Defines an FAQ item type and exports a default list of school-related FAQ entries.",
  "frontend/src/components/school/FAQSection.tsx": "Shows an accordion-based FAQ list for a school.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Image gallery with clickable thumbnails that open a modal viewer with larger images.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "Contact form component with validation, submission simulation, and success alert for school inquiries.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Displays a Google Maps embed and link based on a provided location, with fallback when location is missing.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "Renders a scrollable banner image gallery with pagination, keyboard navigation, and fallback image handling.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Fetches and displays school reviews, shows average rating, and includes an authenticated review submission form.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Lists training courses with metadata and navigation to course details, including an explore-scroll interaction.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Embeds a YouTube video extracted from various URL formats or shows a placeholder if unavailable.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Loads and displays similar schools with skeleton loading and fallback when none are found.",
  "frontend/src/config/socialLinks.ts": "Defines a social link type and provides default social link configurations with placeholder URLs.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides hooks to fetch all reviews across schools for admins and a placeholder mutation for deleting reviews.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Provides admin hooks to list, create, update, and delete schools with backend error handling and cache invalidation.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Provides admin hooks to load teachers across schools and perform create/delete operations with validation and cache updates.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Provides admin hooks to load, create, and delete trainings across schools while handling backend errors and cache updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the current Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBlogPosts.ts": "Provides hooks to load all blog posts or a single post using the backend actor with error logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for managing login, identity loading, and authentication state.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches a school's trainings and teachers using React Query and returns loading state.",
  "frontend/src/hooks/useSchoolDetails.ts": "Retrieves full school details, teachers, and trainings with combined loading and error states.",
  "frontend/src/hooks/useSchoolReviews.ts": "Loads reviews for a school and provides a mutation to submit new reviews with cache invalidation.",
  "frontend/src/hooks/useSchools.ts": "Fetches all schools, optionally loads trainings, and filters them by selected training hours with error diagnostics.",
  "frontend/src/hooks/useSchoolsByLocation.ts": "Retrieves schools filtered by country, state, and city with backend error logging.",
  "frontend/src/hooks/useSimilarSchools.ts": "Computes similar schools by comparing training hours and returns top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Fetches a specific school and training for curriculum views with loading and error aggregation.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, variables, dark mode theme, and utility classes.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides structured logging, error normalization, and non‑fatal error detection for backend calls.",
  "frontend/src/lib/blogContent.ts": "Utilities for generating excerpts, splitting blog content into paragraphs, and selecting display excerpts.",
  "frontend/src/lib/curatedSchoolMedia.ts": "Returns curated thumbnails and gallery images for specific schools, currently supporting Vinyasa Yogashala.",
  "frontend/src/lib/locationFormat.ts": "Formats structured location fields, sanitizes segments, and checks for structured location availability.",
  "frontend/src/lib/locationRoutes.ts": "Builds encoded location routes and generates breadcrumb paths for structured locations.",
  "frontend/src/lib/schoolThumbnails.ts": "Provides deterministic thumbnail selection for school IDs using a simple hash and fallback image.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity context providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission details, feature cards, and placeholder descriptive content.",
  "frontend/src/pages/AdminPage.tsx": "Wraps the admin dashboard in an authentication gate using Internet Identity.",
  "frontend/src/pages/BlogPage.tsx": "Displays blog post list with loading, error, empty states, and navigation to individual posts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a single blog post with loading/error handling and paragraph formatting.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact information section and placeholder non-functional contact form.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays a yoga school directory with filters, hero section, and scroll-to interactions.",
  "frontend/src/pages/LocationListingPage.tsx": "Renders a location-based listing of schools with loading, error, and empty states, using decoded URL parameters to fetch and display schools.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Displays a full school profile with banner, sections, gallery, reviews, and inquiry form, handling loading, error, and breadcrumb logic.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Static informational page explaining how to submit or claim a school, with disabled buttons for future functionality.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Shows detailed training curriculum information for a specific school, with navigation, loading/error states, and course details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugins used across the frontend.",
  "project_state.json": "Configuration file capturing project version, goals, architecture notes, known issues with school/blog loading, and existing feature metadata for the Yoga Schools Directory."
}