{
  "backend/main.mo": "Motoko backend with access-controlled CRUD for schools, teachers, trainings, reviews, user profiles, and blog posts.",
  "feature_evidence.json": "Feature evidence report linking feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables and light/dark mode color tokens with global background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all site routes, layout with header/footer, theme provider, and toast system.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin authentication gate using Internet Identity with sign-in/out flows and conditional admin dashboard access.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Tabbed admin dashboard providing navigation to school, teacher, training, and review management sections.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Displays all reviews with school lookup, loading state, and delete confirmation actions.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Provides CRUD management for schools with create/edit dialogs, delete actions, and a table view.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Manages teachers, including creation with school assignment, listing, and deletion.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Handles creation and deletion of training programs with validation and school association.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Renders informational sections explaining how the directory works and its benefits.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with thumbnail, location, training badges, teacher count, and a details button.",
  "frontend/src/components/directory/TeacherList.tsx": "Displays a list of teachers with avatars and specialization badges, or a placeholder if none are provided.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links, contact info, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Provides the top navigation bar with theme toggle, links, logo, and a mobile menu.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Shows an about section for a school with customizable or default descriptive text.",
  "frontend/src/components/school/faqContent.ts": "Exports a list of default FAQ items with common school-related questions and answers.",
  "frontend/src/components/school/FAQSection.tsx": "Displays an accordion-based FAQ list for a school.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Renders an image gallery with clickable thumbnails and a modal viewer, using default images if none are provided.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "Implements a contact form with validation, success messaging, and simulated submission.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Shows a Google Maps embed for a school location with a link to open in Google Maps.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "Displays a banner with school name, location, background image, and optional inquiry button.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Displays school reviews, calculates averages, and provides an authenticated form for submitting new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Renders a list of training courses with metadata, descriptions, and actions to view curriculum or inquire.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Extracts a YouTube video ID and embeds the video or shows a fallback message if unavailable.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and displays similar schools with loading and empty states.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides admin hooks to fetch all reviews across schools and a placeholder mutation for deletion.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Admin hooks for listing, creating, updating, and deleting schools with backend error handling.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Admin hooks to fetch, create, and delete teachers aggregated across all schools.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Provides admin queries and mutations for listing, creating, and deleting trainings, with cache invalidation and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBlogPosts.ts": "Fetches all blog posts or a single post using the backend actor with error logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading stored identities and providing login/logout utilities.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches trainings and teachers for a school to populate school card components.",
  "frontend/src/hooks/useSchoolDetails.ts": "Loads a school's details along with its teachers and trainings, exposing loading and error states.",
  "frontend/src/hooks/useSchoolReviews.ts": "Fetches school reviews and provides a mutation to submit new reviews with cache updates.",
  "frontend/src/hooks/useSchools.ts": "Queries all schools and applies training-hour filtering with optional training fetches and error logging.",
  "frontend/src/hooks/useSimilarSchools.ts": "Computes similar schools by comparing training hours and returns top-scoring matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Retrieves a school and a training by ID for curriculum pages, with loading and error aggregation.",
  "frontend/src/index.css": "Defines Tailwind base styles and color themes for light and dark modes.",
  "frontend/src/lib/backendDiagnostics.ts": "Provides a helper to log structured diagnostic info for failed backend calls.",
  "frontend/src/lib/blogContent.ts": "Provides helpers to generate excerpts, split blog content into paragraphs, and choose between explicit or generated excerpts.",
  "frontend/src/lib/schoolThumbnails.ts": "Maps school IDs to deterministic thumbnail images using a simple hash, with a fallback thumbnail.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission info, feature cards, and placeholder text.",
  "frontend/src/pages/AdminPage.tsx": "Wraps the admin dashboard with an authentication gate using Internet Identity.",
  "frontend/src/pages/BlogPage.tsx": "Displays a list of blog posts with loading, error, and empty states, using generated excerpts.",
  "frontend/src/pages/BlogPostPage.tsx": "Shows a full blog post with featured image, paragraphs, and navigation back to the blog.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information cards and a non-functional placeholder contact form.",
  "frontend/src/pages/DirectoryPage.tsx": "Shows a directory of schools with filtering, banners, scroll controls, and loading/error handling.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Renders a detailed school profile page with sections for teachers, FAQs, media, maps, reviews, and inquiry form, including loading and error states.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Static informational page describing how users can submit or claim a school, with disabled placeholder buttons for future workflows.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Displays detailed curriculum information for a specific training, handling loading/error states and generating highlights from the description.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL parameters, including persistent session-based retrieval and hash cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "JSON metadata describing project state, features, issues, and architectural notes for the yoga school directory system."
}