{
  "backend/main.mo": "Motoko canister storing schools, teachers, and trainings with CRUD-like add functions and query retrieval including search and filtering by school.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and related components for Google Maps, reusable map component, and similar schools.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend pages, components, hooks, and styling files.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH color variables for light and dark themes and global background/foreground setup.",
  "frontend/index.html": "HTML root file loading the React app entrypoint and defining the document structure.",
  "frontend/src/App.tsx": "Main React app routing setup using TanStack Router with global layout, theme provider, and toaster notifications.",
  "frontend/src/components/directory/SchoolCard.tsx": "School card component showing key school info, training badges, teacher count, and navigation to the detail page.",
  "frontend/src/components/directory/TeacherList.tsx": "List component rendering teacher cards with avatars and specialization badges or an empty state message.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright, attribution link with UTM tracking, and branding.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo navigation and light/dark theme toggle.",
  "frontend/src/components/school/faqContent.ts": "Exports a list of default FAQ items for school pages.",
  "frontend/src/components/school/FAQSection.tsx": "FAQ accordion component rendering a list of questions and answers inside a styled card.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Displays a gallery of images with a modal viewer, using default images if none are provided.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Shows a Google Maps embed and link for a school location, with fallback when no location is provided.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Embeds a YouTube video after extracting its ID or shows a placeholder if unavailable.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and displays similar schools with loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useSchoolCardData.ts": "Loads a school's trainings and teachers via the backend actor for card-level display.",
  "frontend/src/hooks/useSchoolDetails.ts": "Fetches detailed school, teacher, and training data with shared loading and error state.",
  "frontend/src/hooks/useSchools.ts": "Retrieves all schools and optionally filters them by matching training hours.",
  "frontend/src/hooks/useSimilarSchools.ts": "Hook that fetches schools and scores them by matching training hours to return top similar schools.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH color variables, theme tokens, and utility layers.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and wraps the app with Internet Identity.",
  "frontend/src/pages/DirectoryPage.tsx": "Directory page showing filterable school listings with loading, error, and empty states.",
  "frontend/src/pages/SchoolDetailPage.tsx": "School detail page displaying school info, trainings, media sections, teachers, and similar schools with loading and error handling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, OKLCH color mappings, animations, and plugins.",
  "project_state.json": "Project metadata capturing requirements, features, known issues, and current build state."
}