{
  "backend/main.mo": "Motoko canister implementing access-controlled CRUD for schools, teachers, trainings, reviews, user profiles, and blog posts using maps and lists.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, theme variables, and dark-mode overrides for global styling.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout wrapper, query client, and theme provider.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Component gating admin access with Internet Identity login, sign-out handling, and fallback UI when unauthenticated.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Tabbed admin dashboard rendering CRUD sections for schools, teachers, trainings, and reviews.",
  "frontend/src/components/admin/sections/ReviewsAdminSection.tsx": "Displays all reviews with school names and provides deletion via admin hooks and confirmation dialogs.",
  "frontend/src/components/admin/sections/SchoolsAdminSection.tsx": "Provides full CRUD management for schools with forms, dialogs, and validation using admin school hooks.",
  "frontend/src/components/admin/sections/TeachersAdminSection.tsx": "Lists teachers and allows creating and deleting them, including selecting associated schools.",
  "frontend/src/components/admin/sections/TrainingsAdminSection.tsx": "Manages training programs with creation, validation of hours, and deletion tied to schools.",
  "frontend/src/components/common/CopyLinkButton.tsx": "A button that copies a given or current URL to the clipboard and shows success feedback.",
  "frontend/src/components/common/SocialLinks.tsx": "Renders a row of icon links filtered to only valid URLs.",
  "frontend/src/components/directory/DirectoryInfoSections.tsx": "Static marketing sections explaining how the directory works and why users should choose it.",
  "frontend/src/components/directory/SchoolCard.tsx": "Displays a school card with image, name, location, training badges, teacher count, and a details button.",
  "frontend/src/components/directory/TeacherList.tsx": "Renders a list of teacher cards with initials avatar and specialization, or an empty-state message.",
  "frontend/src/components/layout/Footer.tsx": "Footer with about text, navigation links, social links, and copyright plus attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation links, theme toggle, and responsive menu including social links.",
  "frontend/src/components/school/AboutSchoolSection.tsx": "Shows an About section with a default or provided description of the school.",
  "frontend/src/components/school/faqContent.ts": "Exports a list of default FAQ items with predefined questions and answers.",
  "frontend/src/components/school/FAQSection.tsx": "Displays FAQ items in an accordion within a card layout.",
  "frontend/src/components/school/ImageGallerySection.tsx": "Provides a photo gallery grid with a modal viewer and default images if none supplied.",
  "frontend/src/components/school/SchoolInquiryFormSection.tsx": "Inquiry form for contacting a school with validation, submission simulation, and success message.",
  "frontend/src/components/school/SchoolMapSection.tsx": "Displays a Google Maps embed and link for a school location, with fallback messaging when no location is provided.",
  "frontend/src/components/school/SchoolProfileBanner.tsx": "Renders a large banner image with the school name, location, and optional inquiry button.",
  "frontend/src/components/school/SchoolReviewsSection.tsx": "Fetches and displays school reviews, calculates averages, and provides a form for authenticated users to submit new reviews.",
  "frontend/src/components/school/SchoolTrainingCoursesSection.tsx": "Lists training courses with hours, estimated days, descriptions, and actions to view curriculum or inquire.",
  "frontend/src/components/school/SchoolVideoEmbedSection.tsx": "Extracts a YouTube video ID and displays an embedded player or a fallback message if unavailable.",
  "frontend/src/components/school/SimilarSchoolsSection.tsx": "Fetches and shows similar schools with loading and empty states using SchoolCard components.",
  "frontend/src/config/socialLinks.ts": "Defines default social media link configurations with labels, icons, and empty hrefs.",
  "frontend/src/hooks/admin/useAdminReviews.ts": "Provides hooks to load all school reviews for admin and a placeholder mutation for deleting reviews.",
  "frontend/src/hooks/admin/useAdminSchools.ts": "Provides React Query hooks for admins to list, create, update, and delete schools using the backend actor with error handling and cache invalidation.",
  "frontend/src/hooks/admin/useAdminTeachers.ts": "Implements admin hooks to fetch teachers across all schools and to create or delete teachers with proper backend calls and cache refresh.",
  "frontend/src/hooks/admin/useAdminTrainings.ts": "Offers admin hooks to retrieve trainings across all schools and to create or delete trainings while managing errors and cache updates.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on user identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBlogPosts.ts": "Defines hooks to fetch all blog posts or a single blog post through the actor with error logging and conditional fetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, including login, logout, status, and identity persistence.",
  "frontend/src/hooks/useSchoolCardData.ts": "Fetches a school's teachers and trainings for card display using React Query with conditional loading and caching.",
  "frontend/src/hooks/useSchoolDetails.ts": "Retrieves full school details, including teachers and trainings, with coordinated queries and loading/error aggregation.",
  "frontend/src/hooks/useSchoolReviews.ts": "Handles loading and submitting school reviews through query and mutation hooks with error handling and cache invalidation.",
  "frontend/src/hooks/useSchools.ts": "Fetches schools and optionally filters them by training hours, including loading associated trainings when needed.",
  "frontend/src/hooks/useSchoolsByLocation.ts": "Retrieves schools matching a given country, state, and city, with backend failure logging.",
  "frontend/src/hooks/useSimilarSchools.ts": "Finds schools similar to a given one by comparing training hour overlaps and returns top matches.",
  "frontend/src/hooks/useTrainingCurriculumData.ts": "Loads a school and training by ID and returns combined loading and error state.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/src/lib/backendDiagnostics.ts": "Logs structured diagnostic data for backend call failures.",
  "frontend/src/lib/blogContent.ts": "Provides helpers for generating excerpts, splitting content, and selecting display excerpts.",
  "frontend/src/lib/locationFormat.ts": "Formats structured locations, sanitizes segments, and checks for presence of structured data.",
  "frontend/src/lib/locationRoutes.ts": "Builds URL paths and breadcrumbs for structured locations with encoding/decoding utilities.",
  "frontend/src/lib/schoolThumbnails.ts": "Deterministically maps school IDs to thumbnail images using a simple hash.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, features, and informational content.",
  "frontend/src/pages/AdminPage.tsx": "Wraps the admin dashboard with an access gate based on Internet Identity authentication.",
  "frontend/src/pages/BlogPage.tsx": "Fetches and displays a grid of blog posts with loading, error, and empty states, linking each post to its detail page.",
  "frontend/src/pages/BlogPostPage.tsx": "Loads and renders a full blog post with paragraphs, featured image, and navigation back to the blog list, handling loading and error states.",
  "frontend/src/pages/ContactPage.tsx": "Shows static contact information and a non-functional placeholder contact form.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays a directory of yoga schools with filtering by training hours, banner hero section, and scroll-to filters/results behavior.",
  "frontend/src/pages/LocationListingPage.tsx": "Lists schools filtered by decoded country, state, and city parameters with loading, error, and empty states.",
  "frontend/src/pages/SchoolDetailPage.tsx": "Renders detailed school information including banner, about section, courses, teachers, media, reviews, and inquiry form, with loading and error handling.",
  "frontend/src/pages/SubmitClaimSchoolPage.tsx": "Static informational page offering submit and claim school options with disabled buttons and guidelines.",
  "frontend/src/pages/TrainingCurriculumPage.tsx": "Fetches and displays detailed training curriculum info with loading, error states, and structured school data.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, including hash parsing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing features, architecture notes, known issues, and versioned state."
}