{
  "kind": "build_request",
  "title": "Fix recurring \"Failed to load schools\" by making backend school search reliable and ensuring demo data exists after deploy/upgrade",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-45",
      "text": "Fix the backend `searchSchoolsByName(\"\")` path so it never traps/rejects for anonymous users and consistently returns a `[School]` (possibly empty), ensuring the Directory page can load schools without triggering the generic failure banner.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i got this error again ( Failed to load schools. Please try again later. )"
        ]
      },
      "acceptanceCriteria": [
        "Calling `searchSchoolsByName(\"\")` succeeds for anonymous callers and returns an array (empty or non-empty) without trapping.",
        "If no schools exist, `searchSchoolsByName(\"\")` returns `[]` rather than rejecting the call.",
        "The Directory page no longer shows the error banner solely due to `searchSchoolsByName(\"\")` failing."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Ensure the backend has idempotent demo/seed data available immediately after installation and after upgrades so the Directory page has schools to display by default. Seeding must be safe to run multiple times without trapping due to duplicates, and seeded schools must be discoverable via the existing frontend fetch path `searchSchoolsByName(\"\")`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i got this error again ( Failed to load schools. Please try again later. )"
        ]
      },
      "acceptanceCriteria": [
        "After a fresh deploy, loading the Directory page results in a non-empty school list without requiring any manual calls or admin actions.",
        "After an upgrade/redeploy, loading the Directory page still results in a non-empty school list (seeded data persists or is re-seeded idempotently).",
        "Running the seeding logic multiple times does not trap (no duplicate-key traps)."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Update the frontend Directory error state to provide a user-actionable retry control while keeping the existing user-facing message in English. The retry must re-run the schools query without requiring a full page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "i got this error again ( Failed to load schools. Please try again later. )"
        ]
      },
      "acceptanceCriteria": [
        "When the Directory page is in an error state, it still displays exactly the message: \"Failed to load schools. Please try again later.\"",
        "The error UI includes a clearly labeled \"Retry\" action that triggers a React Query refetch for the schools query.",
        "If the backend becomes available, clicking \"Retry\" loads and renders the schools grid without a full page reload."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in `backend/main.mo`).",
    "Only add `backend/migration.mo` if required by an upgrade to preserve existing state (conditional migration policy).",
    "Do not modify any files under `frontend/src/components/ui` or other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not introduce external databases or third-party auth; keep Internet Identity as-is.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new filters or new directory features unrelated to fixing school loading reliability.",
    "Changing the existing user-facing error message text on the Directory page (other than adding a retry control around it).",
    "Introducing new backend services or non-Motoko backend code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}