{
  "kind": "build_request",
  "title": "Update School Detail banner to match single-row photo strip (no collage) like provided reference",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-138",
      "text": "Update the School Detail page banner UI (component: `frontend/src/components/school/SchoolProfileBanner.tsx`) to avoid the current collage-style 2x2 image grid and instead render a single-row, 4-tile photo strip that visually matches the uploaded reference (`image-7.png`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "very good need some improvement like dont show like image  collage  you should show like this"
        ]
      },
      "acceptanceCriteria": [
        "On desktop/wide layouts, the banner shows 4 images in a single horizontal row (not a 2x2 grid).",
        "Images use `object-cover` and do not appear stretched; each tile maintains a consistent aspect ratio.",
        "If only 1 image is available, the banner renders a single full-width image tile gracefully (no empty tiles).",
        "The existing dark gradient readability overlay, school name, and location remain present and readable over the images.",
        "All user-facing and accessibility text introduced/changed remains in English."
      ]
    },
    {
      "id": "REQ-139",
      "text": "Adjust the School Detail banner pagination/controls in `frontend/src/components/school/SchoolProfileBanner.tsx` to match the reference interaction pattern: keep left/right navigation arrows for multi-page photo sets, and replace the current centered remaining-count overlay with a compact “See photos {count}” style control on the last visible tile when additional photos exist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "dont show like image  collage  you should show like this"
        ]
      },
      "acceptanceCriteria": [
        "When more than 4 banner images exist, left/right navigation arrows are available and usable (mouse + keyboard) with English `aria-label`s (e.g., “Previous photos”, “Next photos”).",
        "When more than 4 images exist, the 4th tile displays a compact overlay control that communicates the remaining count in the format “See photos {remainingCount}” (English).",
        "The “See photos {remainingCount}” overlay does not block the school name/location overlay readability (no overlapping that makes the title/location hard to read).",
        "The banner layout remains stable (no layout shift) when navigating pages.",
        "No changes are made to Directory listing SchoolCards; this change applies only to the School Detail banner."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (immutable UI component sources).",
    "Keep all user-facing text and accessibility labels in English.",
    "Do not introduce new backend methods or data requirements for this change."
  ],
  "nonGoals": [
    "Do not change the Directory page hero/banner behavior.",
    "Do not reintroduce any collage/multi-tile behavior into `frontend/src/components/directory/SchoolCard.tsx` (directory cards).",
    "Do not route images through the backend; continue using existing curated/static image URLs already provided by current logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}