{
  "kind": "build_request",
  "title": "Make School Detail banner match School Card carousel style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-114",
      "text": "Update the School Profile banner component (`frontend/src/components/school/SchoolProfileBanner.tsx`) so it can display a carousel/slider of multiple photos (visually and interactively similar to the existing directory School Card media carousel), while preserving the existing overlay readability treatment, school name + location, and optional “Inquire Now” button behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-21"
        ],
        "quotes": [
          "school card is fine  i want to school banner is also like this"
        ]
      },
      "acceptanceCriteria": [
        "When multiple banner images are available, the banner shows one image at a time and provides accessible Previous/Next controls (with English aria-labels) to cycle through images.",
        "When only one banner image is available, the banner renders a single image with no carousel controls.",
        "The banner continues to display the existing gradient overlay, school name, location, and the optional “Inquire Now” button exactly as before.",
        "Keyboard interaction is supported for cycling slides (e.g., left/right arrow behavior consistent with the SchoolCard carousel).",
        "If an image fails to load, the banner shows a graceful fallback state instead of breaking layout."
      ]
    },
    {
      "id": "REQ-115",
      "text": "Wire the School Detail page (`frontend/src/pages/SchoolDetailPage.tsx`) to pass a list of curated gallery images (when available via `getCuratedGalleryImages(school.id)`) into the School Profile banner so the banner carousel uses the same curated media as the School Card, with a sensible fallback to the existing default banner image when curated images are not present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-21"
        ],
        "quotes": [
          "school card is fine  i want to school banner is also like this"
        ]
      },
      "acceptanceCriteria": [
        "For schools with curated gallery images, the School Profile banner uses those images as the carousel slides (not just the first image).",
        "For schools without curated gallery images, the School Profile banner uses the existing default banner image (`/assets/generated/school-profile-banner.dim_1600x420.png`).",
        "No backend changes are required to support the banner carousel."
      ]
    },
    {
      "id": "REQ-116",
      "text": "Keep user-facing text in English for any new accessibility labels or fallback messaging introduced by the School Profile banner carousel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-21"
        ],
        "quotes": [
          "school card is fine  i want to school banner is also like this"
        ]
      },
      "acceptanceCriteria": [
        "All newly introduced aria-labels and any visible fallback text added for the banner carousel are in English.",
        "No existing user-facing text is changed to a non-English language."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (immutable shadcn UI sources).",
    "Do not route images through the backend; continue using existing static assets and curated media mappings.",
    "Respect the existing styling/theme conventions and do not introduce breaking layout changes to the School Detail page."
  ],
  "nonGoals": [
    "Do not change the existing directory School Card carousel behavior or layout.",
    "Do not add new backend endpoints, fields, or data models for banner images.",
    "Do not add new generated image assets unless explicitly requested later."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}