{
  "kind": "build_request",
  "title": "Fix Directory schools not showing by ensuring backend always serves seeded school data",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-129",
      "text": "Fix the root cause of the Directory page showing no schools by ensuring the Motoko backend always has browseable School data for anonymous users immediately after canister install and after upgrades, and that `searchSchoolsByName(\"\")` reliably returns a `[School]` without trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "schools are not showing fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "After a fresh canister install (no prior state), calling `searchSchoolsByName(\"\")` returns a non-empty `[School]` (at least 6 demo schools) for an anonymous caller.",
        "After a canister upgrade, calling `searchSchoolsByName(\"\")` still returns schools (does not depend on manual Admin actions).",
        "Demo seeding is idempotent: redeploying/upgrading multiple times does not trap due to duplicate IDs and does not create duplicate demo records.",
        "Seeded demo data includes at least one Training and at least one Teacher per demo school; across all seeded trainings, the hour categories 100/200/300/500 are represented so frontend filters can match results.",
        "`searchSchoolsByName(\"\")`, `getTeachersBySchool`, and `getTrainingsBySchool` do not trap during normal anonymous browsing; when data is missing they return safe empty arrays."
      ]
    },
    {
      "id": "REQ-130",
      "text": "Implement stable persistence for directory data in `backend/main.mo` so Schools, Teachers, Trainings, Reviews, UserProfiles, and BlogPosts survive canister upgrades (use `system func preupgrade()` to store stable snapshots and `system func postupgrade()` to restore in-memory structures), without erasing existing stored records.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "schools are not showing fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "After creating or updating records (e.g., via existing admin methods), a canister upgrade preserves Schools/Teachers/Trainings/Reviews/UserProfiles/BlogPosts and they remain queryable afterward.",
        "Upgrade logic does not overwrite or clear existing non-demo data; demo seeding only adds missing demo records when appropriate.",
        "No `Runtime.trap` occurs during `preupgrade()`/`postupgrade()` in normal operation (including when state is empty)."
      ]
    },
    {
      "id": "REQ-131",
      "text": "Ensure the frontend Directory experience (`frontend/src/hooks/useSchools.ts` + `frontend/src/pages/DirectoryPage.tsx`) correctly renders schools once the backend returns seeded data, and does not show the destructive error banner for the normal empty-directory case (i.e., a successful backend response of an empty array).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "schools are not showing fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "When `actor.searchSchoolsByName(\"\")` succeeds and returns a non-empty array, the Directory page displays the school grid with cards.",
        "When `actor.searchSchoolsByName(\"\")` succeeds and returns `[]`, the Directory page shows the existing empty state (not the destructive error banner).",
        "When `actor.searchSchoolsByName(\"\")` fails (throws), the Directory page shows the existing English error message \"Failed to load schools. Please try again later.\" and the Retry button re-runs the query without a full refresh."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Only create `backend/migration.mo` if required by the platform migration policy and existing stable state changes.",
    "Do not modify any files under `frontend/src/components/ui` or any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Redesigning the Directory page UI/visual theme beyond what is necessary to confirm schools render again.",
    "Adding new third-party services, external databases, or non-Internet-Identity authentication.",
    "Implementing real-time updates (WebSockets/push) for directory listings."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}