{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add reusable social profile links to header and footer",
  "requirements": [
    {
      "id": "REQ-92",
      "summary": "Create a reusable SocialLinks component driven by a centralized config and render only non-empty social URLs with accessible, secure external links.",
      "acceptanceCriteria": [
        "A new reusable component exists (e.g., `frontend/src/components/common/SocialLinks.tsx`) that accepts a list of `{ label, href, icon }` items and renders only valid/defined `href` values.",
        "Each rendered social link uses an anchor tag with `target=\"_blank\"` and `rel=\"noopener noreferrer\"`.",
        "Each rendered social link has an accessible name via `aria-label` (English) and/or visible text for screen readers.",
        "If all configured URLs are empty/undefined, the component renders nothing (no empty container)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/socialLinks.ts",
          "operation": "create",
          "description": "Add a single centralized social links configuration exporting an ordered list of items (label, href, icon) with empty-string defaults allowed so the UI can hide unconfigured links."
        },
        {
          "path": "frontend/src/components/common/SocialLinks.tsx",
          "operation": "create",
          "description": "Implement a reusable SocialLinks component that accepts `{ label, href, icon }` items, filters out empty/undefined hrefs, renders a horizontal row of icon links with English `aria-label`s, and uses `target=\"_blank\"` + `rel=\"noopener noreferrer\"`; return `null` when there are no valid links."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Render social profile links in the global footer using SocialLinks, matching existing muted footer styling and preserving current footer navigation.",
      "acceptanceCriteria": [
        "The footer displays a “Follow us” (English) label and a horizontal row of social icons/links when at least one social URL is configured.",
        "The social links visually match the existing footer style (consistent spacing, hover states, and muted text/icon color).",
        "No existing footer navigation links are removed or broken."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Integrate the SocialLinks component into the footer with a “Follow us” label and muted-foreground styling consistent with existing footer typography; ensure it only appears when at least one configured link is present and keep all existing footer links intact."
        }
      ]
    },
    {
      "id": "REQ-94",
      "summary": "Add space-efficient social profile links to the global header for desktop and mobile without breaking existing navigation layouts.",
      "acceptanceCriteria": [
        "On desktop, social icons/links appear in the header (e.g., near the theme toggle) without causing wrapping/overflow at common breakpoints.",
        "On mobile, social links are either included in the dropdown menu or otherwise accessible without crowding the header controls.",
        "All header social links meet the same accessibility and security requirements as the footer links (English aria-labels, new-tab behavior, `rel` attributes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add SocialLinks to the header in a compact placement on desktop (e.g., adjacent to the theme toggle) and ensure it does not cause overflow; add accessible social links to the mobile dropdown (as external anchors with proper `target`/`rel`) so links remain reachable without crowding the header."
        }
      ]
    }
  ]
}