{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Directory empty/error rendering when school list is empty vs backend failure",
  "requirements": [
    {
      "id": "REQ-131",
      "summary": "Ensure Directory page renders schools from backend, treats successful empty results as empty state (not error), and supports retry on failures without full refresh.",
      "acceptanceCriteria": [
        "When `actor.searchSchoolsByName(\"\")` succeeds and returns a non-empty array, the Directory page displays the school grid with cards.",
        "When `actor.searchSchoolsByName(\"\")` succeeds and returns `[]`, the Directory page shows the existing empty state (not the destructive error banner).",
        "When `actor.searchSchoolsByName(\"\")` fails (throws), the Directory page shows the existing English error message \"Failed to load schools. Please try again later.\" and the Retry button re-runs the query without a full refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSchools.ts",
          "operation": "modify",
          "description": "Adjust the React Query behavior so a previously-thrown error does not cause the Directory to show a destructive error banner when a subsequent successful response returns an empty array (e.g., ensure UI can distinguish \"no data yet\" vs \"successful empty\"). Keep thrown errors reserved for genuine failures; continue returning `[]` for non-fatal anonymous browsing conditions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Refine error-banner gating to show the destructive error banner only for genuine query failures (not merely when the schools array is empty). Ensure the Retry button triggers `refetch()` and updates the list without a full page refresh. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}