{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 100-hour YTT option to directory filters and informational content",
  "requirements": [
    {
      "id": "REQ-83",
      "summary": "Add a 100-hour option to the Directory page training-hours filter so users can filter schools by 100-hour YTT programs.",
      "acceptanceCriteria": [
        "On `/` (`frontend/src/pages/DirectoryPage.tsx`), the filter checklist includes: 100 Hours, 200 Hours, 300 Hours, 500 Hours.",
        "Selecting 100 Hours adds it to the active filters badges and filters the school results based on trainings with `hours == 100` (using the existing `useSchools(selectedHours)` behavior).",
        "User-facing labels remain in English and match the existing pattern (e.g., \"100 Hours\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Update the training-hours checklist to render [100, 200, 300, 500] (instead of [200, 300, 500]) and ensure toggling 100 updates badges and continues to pass selectedHours into useSchools for filtering. Use the existing shadcn-ui Checkbox/Label/Badge components for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Update Directory hero and directory info copy to include 100-hour YTT alongside 200/300/500-hour categories.",
      "acceptanceCriteria": [
        "The Directory hero subtitle on `frontend/src/pages/DirectoryPage.tsx` mentions 100, 200, 300, and 500-hour teacher training programs (English text).",
        "In `frontend/src/components/directory/DirectoryInfoSections.tsx`, any text that currently lists only 200/300/500 is updated to include 100 as well (English text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Revise the hero subtitle copy to explicitly mention 100, 200, 300, and 500-hour teacher training programs (English), keeping the existing layout and shadcn-ui Badge/Button styling intact; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/directory/DirectoryInfoSections.tsx",
          "operation": "modify",
          "description": "Update any informational text that enumerates hour levels (e.g., the 'Browse Programs' card copy) to include 100-hour offerings alongside 200/300/500 (English). Keep the existing shadcn-ui Card/Badge typography and spacing consistent; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Add a 100-Hour YTT entry to the “Training Hour Levels Explained” section using the existing Card-based layout and styling.",
      "acceptanceCriteria": [
        "`frontend/src/components/directory/DirectoryInfoSections.tsx` includes a visible \"100-Hour YTT\" entry in the Training Hour Levels section, styled consistently with the existing 200/300/500 cards.",
        "All new content is in English and does not introduce new backend dependencies."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/directory/DirectoryInfoSections.tsx",
          "operation": "modify",
          "description": "Extend the Training Hour Levels Explained grid to include a new shadcn-ui Card for \"100-Hour YTT\" with copy and bullet points consistent with the existing 200/300/500 cards. Adjust the grid column classes if needed so four cards display cleanly while preserving current styling; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}