{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-15T03:49:58.466Z",
  "summary": "REQ-84 appears implemented (Directory hero subtitle and at least some informational copy now includes 100/200/300/500). REQ-83 (filter checklist + filtering behavior) and REQ-85 (add 100-Hour card in the Training Hour Levels section) cannot be confirmed from the provided truncated diffs; they may be implemented but are not visible in the evidence shown. The diff also includes additional UI/UX changes on DirectoryPage not requested by the BuildRequest (e.g., scroll-to-results/filters behavior and CTA buttons).",
  "missing_requirements": [
    {
      "id": "REQ-83",
      "requirement": "Update the Directory page training-hours filter to include a 100-hour option alongside the existing 200/300/500 options, including active filter badges and filtering behavior for trainings with hours == 100.",
      "reason": "The provided truncated snippet of `DirectoryPage.tsx` shows the hero section and state (`selectedHours`) but does not include the actual filter checklist UI (checkbox list) nor evidence of a 100-hour option label/badge behavior in the visible portion. The file summary mentions the filter controls, but the diff excerpt does not show them, so this cannot be verified from the evidence provided.",
      "evidence": [
        "frontend/src/pages/DirectoryPage.tsx (truncated)",
        "frontend-file-summaries.txt (mentions filter controls but no code shown)"
      ]
    },
    {
      "id": "REQ-85",
      "requirement": "Extend the “Training Hour Levels Explained” section to include a visible “100-Hour YTT” card entry styled consistently with existing 200/300/500 cards.",
      "reason": "`DirectoryInfoSections.tsx` is truncated and only shows the “How It Works” section copy updated to mention 100/200/300/500. The diff excerpt does not include the “Training Hour Levels Explained” section, so the presence of a new “100-Hour YTT” card cannot be verified.",
      "evidence": [
        "frontend/src/components/directory/DirectoryInfoSections.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added scroll-to-results and scroll-to-filters behavior with focus management, plus new hero CTA buttons (“Browse Schools” / “Filter Programs”).",
      "reason": "These UI/UX behaviors are not part of REQ-83/84/85, which only request hour filter options and copy/info updates.",
      "evidence": [
        "frontend/src/pages/DirectoryPage.tsx (truncated)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/directory/DirectoryInfoSections.tsx",
    "frontend/src/pages/DirectoryPage.tsx",
    "project_state.json"
  ]
}